create database if not exists Diploma;

use Diploma;


/* Course */
CREATE TABLE IF NOT EXISTS Course(
	id_Course INT PRIMARY KEY AUTO_INCREMENT,
    title_Course VARCHAR(255) NOT NULL,
    description_Course text(2500) NOT NULL,
    src_Course VARCHAR(255) NOT NULL
);


CREATE TABLE IF NOT EXISTS Programs(
	id_Programs INT PRIMARY KEY AUTO_INCREMENT,
    description_Programs text(2500) NOT NULL,
    fk_Programs_Course INT NOT NULL
);


CREATE TABLE IF NOT EXISTS Times(
	id_Times INT PRIMARY KEY AUTO_INCREMENT,
    time_Times VARCHAR(255) NOT NULL,
    days_Times VARCHAR(255) NOT NULL,
    start_Times DATE NOT NULL,
    fk_Times_Course INT NOT NULL
);


CREATE TABLE IF NOT EXISTS Price(
	id_Price INT PRIMARY KEY AUTO_INCREMENT,
    countLessons_Price INT NOT NULL,
    countAcademOclock_Price INT NOT NULL,
    priceGroupLessons_Price INT NOT NULL,
    priceIndividLessons_Price INT NOT NULL,
    fk_Price_Course INT NOT NULL
);


ALTER TABLE Programs ADD CONSTRAINT Programs_Course FOREIGN KEY (fk_Programs_Course) REFERENCES Course(id_Course);
ALTER TABLE Times ADD CONSTRAINT Times_Course FOREIGN KEY (fk_Times_Course) REFERENCES Course(id_Course);
ALTER TABLE Price ADD CONSTRAINT Price_Course FOREIGN KEY (fk_Price_Course) REFERENCES Course(id_Course);


ALTER TABLE news ADD COLUMN fk_News_Course INT;
ALTER TABLE news ADD CONSTRAINT News_Course FOREIGN KEY (fk_News_Course) REFERENCES Course(id_Course);


/* JavaScript*/
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("JavaScript","Курси JavaSсript у Львові охоплюють основи створення інтерактивних веб-сторінок за допомогою мови JavaScript і об’єктно-орієнтованого програмування. Основний акцент в курсі зроблений на практичних завданнях, що дозволяє краще засвоїти матеріал і закріпити отримані знання. Використання фреймворку JQuery і JQuery UI дозволить легко і елегантно організувати логіку роботи веб-додатків будь-якої складності на стороні клієнта. Ви також навчитеся основним засобам доступу до вузлів DOM документа для ефективної розробки сценаріїв сторінки.","/src/img/course_JS.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Що таке JavaScript? Як викликати JavaScript? З чим взаємодіє JavaScript?",1),
("Типи даних, вирішення логічних задач на JavaScript.",1),
("Структура DOM документа, робота з DOM за допомогою JavaScript.",1),
("Функції, область видимості змінних, інші плюшки.",1),
("Робота з формами, стилями, обробники подій.",1),
("Приклад обробки: натиснення на кнопку, скролінг елемента, наведення курсора мишки, обробки форм на стороні клієнта...",1),
("Створення слайдера на JavaScript.",1),
("Загальні поняття ООП: клас, об'єкт, особливості ООП в JavaScript.",1),
("Масиви та асоціативні масиви, робота з масивами на практиці.",1),
("Об’єкт Math та його користь для сценарію, приклад годинника на JavaScript.",1),
("Навіщо потрібні фреймворки? Що таке JQuery? Де скачати і як підключити?",1),
("Робота з DOM за допомогою JQuery, селектори та ієрархія JQuery, фільтри, приклади складних фільтрів в JQuery.",1),
("Анімація в JQuery, прості анімаційні ефекти, ланцюжки з анімацій.",1),
("Створення слайдера на JQuery.",1),
("JQuery UI: де скачати та як встановити? Ефекти, підключення календаря.",1),
("Плагіни: draggable, droppable.",1),
("Що таке parallax scrolling? Застосування parallax scrolling на практиці.",1);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("17:30 – 19:00","ПН-СР-ПТ","2017-02-20",1),
("10:30 – 13:30","СБ-НД","2017-02-18",1);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,4500,10000,1);



/* JavaScript Advanced */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("JavaScript Advanced","Курси JavaScript Advanced охоплюють всі необхідні знання мови JavaScript які на сьогоднішній день є затребуваними в ІТ компаніях. Для вступу на курс необхідно володіти знаннями HTML/CSS на високому рівні, а також JavaScript (бажано пройти курс JavaScript). На курсі студенти випробують усі сторони ООП програмування на JavaScript, познайомляться з регулярними виразами та технологією AJAX. Також розглянуть популярні JavaScript фреймворки: Angular.js, Node.js, за допомогою яких студенти зможуть створювати неймовірні веб додатки які нагадують десктоп, а також створювати back-end частину. На курсі перевагу надають саме практичним заняттям, створенню міні додатків, а також окремих частин веб сторінок. На курсі ви навчитеся основним засобам JavaScript для ефективної та сучасної веб розробки.","/src/img/course_JS_Advanced.PNG");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Поняття ООП в JavaScript.",2),
("Варіанти наслідування та прототипування.",2),
("Практика в ООП, this та шаблони виклику функцій.",2),
("Регулярні вирази, здійснення пошуку за допомогою регулярних виразів.",2),
("Використання регулярних виразів для валідації, правила пошуку тексту.",2),
("JSON. Серіалізація, передача даних за допомогою об'єктного запису JavaScript.",2),
("AJAX. HTTP запити, що це? Як працюють. Взаємодія 'КЛІЄНТ - Сервер'.",2),
("Використання методів AJAX для відправки та отримання даних.",2),
("Для чого потрібні фреймворки?",2),
("Підключення до сторінки Angular.js. Двостороннє зв'язування та інші особливості Angular.js.",2),
("Неймовірні веб-додатки що нагадують Desktop.",2),
("Node.js. Що таке серверний JavaScript?",2),
("Які переваги? Асинхронність роботи 'КЛІЄНТ - Сервер'.",2),
("Модулі Node.js. Пишем сервер JavaScript.",2);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("19:00 - 20:30","ВТ-ЧТ","2017-01-17",2),
("14:00 – 17:00","СБ-НД","2017-02-25",2);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,5500,10000,2);



/* Основи програмування */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("Основи програмування","Основи програмування – це безкоштовний курс, програма якого спеціально розроблена для людей без попереднього досвіду у сфері програмування.

Головний акцент ставиться саме на практичні заняття, тому кожен слухач курсу окрім необхідної теорії розпочинає безпосередньо програмувати – самостійно створює цикли, масиви та алгоритми для вирішення конкретних завдань.

Окрім того курс Основи програмування дає змогу усвідомити різницю між різними мовами програмування, завдяки чому Ви зможете обрати той напрямок із світу ІТ технологій, який підходить саме Вам.","/src/img/course_Основи_програмування.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Комп’ютер та його основні компоненти: пристрої зберігання даних, пристрої введення, пристрої виведення, периферійні пристрої комп’ютера.",3),
("Системи числення: двійкова, вісімкова, шістнадцяткова. Робота з ними.",3),
("Типологія мов програмування: функціональні, об’єктно-орієнтовані, аспектно-орієнтовані, скриптові, процедурні.",3),
("Алгоритми. Поняття алгоритму та його значення, типи алгоритмів, основні компоненти алгоритму, побудова алгоритмів.",3),
("Арифметичні операції. Типи даних. Змінні.",3),
("Строго типізовані і не строго типізовані мови програмування, відмінності.",3),
("Створення, оголошення, ініціалізація змінних.",3),
("Синтаксичні конструкції, побудова програми з їх допомогою.",3),
("Умовні конструкції (if, else if, else, switch).",3),
("Цикли (while, do while, for).",3),
("Масиви: одномірні і багатомірні масиви, робота з ними. Цикл foreach.",3),
("Основи GUI(Swing): основні компоненти, розміщення, взаємодія.",3),
("HTML/CSS: поняття тегів, та їх атрибути, розміщення елементів на сторінці. Основи CSS, селектори.",3),
("JavaScript: змінні та функції. Обробка подій.",3);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("09:00 – 10:30","ПН-ВТ-СР-ЧТ-ПТ","2017-01-30",3),
("10:30 – 12:00","ПН-ВТ-СР-ЧТ-ПТ","2017-01-30",3),
("12:00 – 13:30","ПН-ВТ-СР-ЧТ-ПТ","2017-01-30",3);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(12,24,0,1,3);



/* MySQL */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("MySQL","Курси MySQL призначені для програмістів бажаючих познайомитися з мистецтвом проектування баз даних в теорії і на практиці. Після цього курсу Ви зможете не просто самостійно проектувати і використовувати бази даних, але й робити це розумно й ефективно. У світі сучасного промислового програмування програміст, який не володіє SQL – це нонсенс (за винятком рідкісних випадків достатньо вузької спеціалізації). В курсі розглянуті питання теорії баз даних, мови SQL як засобу взаємодії з БД, прийомів правильного проектування БД і складання запитів. Практична частина курсу заснована на сервері MySQL, що робить курс особливо цінним для початківців веб-програмістів.","/src/img/course_MySQL.PNG");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Вступ, реляційні бази даних: що таке база даних? Що таке реляційна база даних?",4),
("Приклади коду на мові SQL (створювати, видаляти, вибирати, оновлювати, вставляти).",4),
("Короткий огляд основних діалектів SQL (MSSQL, Oracle, MySQL, SQLite).",4),
("Знайомство з MySQL. Роль MySQL в розробці Web-Проектів.",4),
("Клієнтські програми для роботи з MySQL (PhpMyAdmin, HeidiSQL, MySQL).",4),
("Основні принципи проектування таблиць: одна таблиця - одна сутність, ключ кандидат, первинний ключ, зовнішній ключ.",4),
("Типи зв'язків: зв'язок 'Один-до-багатьох', зв'язок 'Один-до-одного', зв'язок 'Багато-до-багатьох'.",4),
("Робота з базами даних, робота з таблицями.",4),
("Типи даних SQL, сновні типи даних: вибір типів даних полів таблиць, особливе значення NULL.",4),
("Управління даними на SQL (DML): вставка, видалення, оновлення, вибірка даних.",4),
("Оператор Select і робота з ним.",4),
("Складна вибірка і модифікація даних.",4),
("Збережені процедури і транзакції.",4),
("Специфіка роботи з MySQL.",4),
("Управління доступом до бази даних.",4),
("Команди огляду БД і таблиць.",4),
("Види движків таблиць: MyISAM, InnoDB, Memory.",4);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("19:00 - 20:30","СБ-НД","2017-02-11",4),
("19:00 – 22:00","ВТ-ЧТ","2017-02-07",4);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(12,24,3000,4500,4);



/* Game */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("GAME DEVELOPMENT","Курс “Розробка ігор” створений як для новачків, так і для досвідчених програмістів, які вирішили створити свою гру.З допомогою цього курсу ви не лише освоїте основи програмування, а й розробите свою першу гру використовуючи сучасний рушій Defold та скриптову мову програмування Lua, яка чудово підходить для швидкого написання якісних ігор. Крім того, ви дізнаєтесь, які існують інші фреймворки та рушії, їхні переваги та недоліки, і чому ми працюємо саме з Defold.Протягом курсу ми працюватимемо з графікою та анімацією, музикою, графічним інтерфейсом та фізичним рушієм, а також навчимося працювати у команді з допомогою системи контролю версій Git.Розробка ігор – один з найперспективніших напрямів у сучасному ІТ світі. Якщо ви бажаєте долучитися до команди розробників ігор, завжди мріяли про створення власної гри, тоді цей курс – це саме те, що вам потрібно","/src/img/course/game-new-1.PNG");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Розробка ігор.",5),
("Що таке Game Development та особливості цієї сфери.",5),
("Основи розробки ігор.",5),
("Особливості 2D та 3D ігор, 3D-моделювання.",5),
("Математика для створення ігор.",5),
("Огляд рушіїв та фреймворків для розробки ігор.",5),
("Програмування: основи програмування на Lua та особливості цієї мови, локальні та глобальні змінні, типи даних.",5),
("Конструкції вибору, тернарний оператор, логічні оператори.",5),
("Цикли for, while, repeat..until.",5),
("break, goto i return.",5),
("Ігровий рушій: знайомство з рушієм Defold.",5),
("Відповідь на питання 'Чому не Unity?'",5),
("Об’єкти та основи руху об’єктів, зіткнення об’єктів, обробка зіткнень, анімація об’єктів.",5),
("Звукові ефекти та музика.",5),
("Графічний інтерфейс користувача, збереження даних та налаштувань гравців.",5),
("Випуск гри.",5);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("10:30 – 13:30","СБ-НД","2017-04-15",5);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,4500,1,5);



/* Java */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("JAVA","На даний момент мова Java у Львові займає провідну роль у створенні серверних, міжплатформних і мобільних додатків, вона є основною мовою програмування на платформі Android. Найбільшими перевагами мови Java є її повна незалежність від операційної системи та обладнання, а так само концепція «Напиши один раз – запускай де завгодно». Мова Java дуже проста, компактна і лаконічна, що знижує «рівень входження в мову» і дозволяє програмісту мінімізувати витрату часу на помилки неправильного використання мовних конструкцій, пов’язаних з їх нелогічністю і дублюванням. Дані курси програмування Java призначені для того, щоб познайомити слухача з базовими концепціями та технологіями програмування на мові Java, володіючи якими освоїти конкретну бібліотеку, або платформу програмування на Java справа техніки і практики. Запрошуємо на курси Java в Logos IT Academy. Пройшовши курси java ви отримаєте досвід роботи над реальним проектом для подальшого працевлаштування. Якщо ви вже знайомі з Java на базовому рівні рекомендуємо розширити свої знання в програмуванні на курсі Java Advanced (професійний рівень), пробне заняття безкоштовне!","/src/img/course/Java-3.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Історія створення мови Java.",6),
("Можливості мови Java, базові поняття і визначення.",6),
("JVM, компілятор, типи змінних, метод main.",6),
("Математичні, логічні, бінарні оператори, if– else, switch.",6),
("Масиви, матриціцикли for, while, do while. Методи.",6),
("Поняття класу і об’єкту. Поля та методи класу. Створення першого класу. Конструктори.",6),
("Модифікатори доступу, гетери та сетер, інкапсуляція, метод toString().",6),
("Композиція, агрегація. Наслідування. КласObject та його методи. Абстрактні класи та інтерфейси. Override, overload. Поліморфізм.",6),
("Enums.",6),
("Collections. Види колекцій, ієрархія класів. List, ArrayList, LinkedList.",6),
("Методи equals, hashCode. Інтерфейс Set, HashSet, LinkedHashSet.",6),
("Інтерфейси Comparable, Comparator. TreeSet.",6),
("Інтерфейс Map та його реалізації TreeMap, LinkedHashMap, HashMap.",6),
("Запис та читання з файлів. Об’єкт File.",6),
("Блоки try -catch– finally, декларація throws. Свої Exceptions.",6),
("Generics. Наслідування, super.",6),
("Багатопоточність, створення потоків Threads, Runnable.",6),
("Concurrency. ExecutorService. Заплановане виконання потоків.",6);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("17:30 - 19:00","ПН-СР-ПТ","2017-01-30",6),
("19:00 – 20:30","ПН-СР-ПТ","2017-01-30",6),
("20:30 – 22:00","ПН-СР-ПТ","2017-01-30",6),
("19:00 – 22:00","ВТ-ЧТ","2017-01-30",6),
("10:30 – 13:30","СБ-НД","2017-02-25",6);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,4500,10000,6);



/* PHP */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("PHP","Найважливіше в навчанні розробника – показати повну картину. І будь-які курси PHP повинні це враховувати. Більш того, курси PHP повинні вести професіонали, які здатні бачити цю картину. Коли людина не просто кодує як мавпа, а розуміє фундаментальні концепції і вже їх проектує разом зі своїм талантом в рядки коду, тоді вона має право називати себе розробником. Така людина запросто пройде співбесіду в престижній компанії, забувши назви якихось функцій. Наші курси розроблені з метою дати необхідні знання і підготувати саме таку людину! Мінімальний рівень підготовки учня може бути практично нульовим. Знань PHP не потрібно, навчання починається з самих азів. Той, хто вже знайомий з основами PHP, зможе сконцентруватися на порадах викладача з грамотного оформлення скриптів. Що дозволить значно поліпшити культуру написання коду і проектування веб-додатків.","/src/img/course/code-programming-php-software-develop-command-language-128-1.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Основи PHP: про PHP, базовий синтаксис, змінні, константи, типи даних, перетворення типів, оператори, операції.",7),
("Розгалуження та функції.",7),
("Оператор, IF, тернарний оператор умови, оператор switch.",7),
("Функції, визначення функції, значення за умовчанням, рекурсія, область видимості і час життя змінних.",7),
("Цикли в PHP: Цикл while. Цикл do… while. Цикл for. Нескінченний цикл. Оператор виходи з циклу. Оператор переривання ітерації циклу.",7),
("Масиви: Обхід масивів в циклі. Функції для роботи з масивами. Багатовимірні масиви. Зумовлені масиви.",7),
("Запити HTTP, параметри URL і форми HTML.",7),
("Що таке сookies і з чим їх їдять.",7),
("Маніпулюємо сookies засобами PHP.",7),
("Що таке сесії PHP і як вони працюють.",7),
("Робимо авторизацію на сайті.",7),
("Робота з базою даних.",7),
("Для чого потрібна база даних?",7),
("Робота з базою даних.",7),
("Засоби PHP для роботи з MySQL.",7),
("Концепція MVC.",7),
("Архітектура програми. Що таке хороший код?",7),
("Архітектура MVC.",7),
("Реалізація MVC в PHP.",7);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("19:00 – 20:30","ПН-СР-ПТ","2017-02-06",7),
("14:00 – 17:00","СБ-НД","2017-02-25",7);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,4500,10000,7);



/* HTML/CSS */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("HTML/CSS","Основи створення сайтів – це перший ступінь навчання професії “Веб-розробник”, так як без знання цих мов неможливо вивчати веб-програмування. Тому даний курс розрахований на людей, які хочуть навчитися робити сайти, але не знають, що їм для цього необхідно вивчати. Навчання розпочнеться з самих азів, тобто з невеликої теоретичної частини, де Ви дізнаєтеся як працює інтернет, познайомитеся з будовою сайту та процесом розробки, встановите необхідні програми для того, щоб можна було почати процес розробки сайту. Потім ви під чітким керівництвом викладача крок за кроком будете розробляти свій власний сайт, який вийде хоч і простим, але зате Ви подолаєте першу сходинку в такій нелегкій справі, як розробка сайту.","/src/img/course/code-programming-html.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Вступ. Як працює інтернет. Що таке сайт. Види сайтів.",8),
("Процес розробки сайту. Що таке гіпертекст, теги та атрибути.",8),
("Підготовка робочого місця.",8),
("Простий,складний приклад веб-сторінки.",8),
("Основи HTML. Структура HTML документа. Основні теги оформлення тексту. Спецсимвол.",8),
("Коментарі в HTML, гіперпосилання.",8),
("Типи зображень для Інтернету. Завантаження зображень на сторінку.",8),
("Списки, форми і їх елементи.",8),
("Основи CSS. Що таке CSS. Cинтаксис CSS. Способи оголошення CSS.",8),
("Селектори (ID, класу, тегу). Cелектори атрибутів.",8),
("Основні властивості стилів. Вкладеність, спадкування та групування властивостей.",8),
("Пріоритети застосування стилів. Псевдокласи і Псевдоелементи.",8),
("Таблиці в HTML і таблична верстка.",8),
("Створення таблиць. Об'єднання осередків. Вкладені таблиці. Стильове оформлення таблиць. Верстка макету сайту за допомогою таблиць.",8),
("Верстка шарами. Основні теги для верстки (DIV і шкали).",8),
("Відступи елементів (маржа і оббивка). Обтічні елементи. Позиціонування блоків.",8),
("Верстка макету сайту за допомогою шарів.",8),
("Стандарти Web. Допоміжні інструменти. Хостинг.",8),
("Проблема «кросбраузерності». Стандарти HTML / CSS.",8),
("Майбутнє за стандартами HTML5 та CSS3.",8),
("Грамотна, універсальна верстка. Завантаження проектів на сервер.",8);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("17:30 – 20:30","ВТ-ЧТ","2016-02-14",8),
("10:30 – 13:30","СБ-НД","2017-02-25",8);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(12,24,3000,4500,8);



/* JAVA ADVANCED */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("JAVA ADVANCED","На курсах навчання Java в Logos IT Academy розглядаються методи створення Інтернет-додатків на мові Java, в тому числі Web-додатків, аплетів, серверних додатків, використання серверних сторінок Java, конструювання та програмування користувацьких бібліотек Java, а також розробка додатків із застосуванням технологій, реалізованих у пакеті J2EE. Крім цього на курсах з програмування Java докладно описуються масиви і функції.

У процесі навчання Java увага слухачів акцентується на розкритті найбільш істотних сторін створення клієнтських і серверних додатків. Викладачі-експерти Logos IT Academy роблять викладений матеріал вельми наочним і допомагають його кращому засвоєнню. В Logos IT Academy Ви можете пройти комплексну програму підготовки на курсах Java і істотно розширити свої уявлення про веб-програмування. На пробному занятті буде проводитися тестування на рівень знань слухача. Якщо ви не знайомі з мовою Java, або не достатньо знайомі, рекомендуємо базовий курс JAVA.","/src/img/course/Java-pro-2.PNG");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Поняття тестування. Види тестування.",9),
("Junit v4. JDBC.",9),
("Hibernate XML Mapping.",9),
("Hibernate Annotation.",9),
("Ant.",9),
("Maven.",9),
("JPA Hibernate.",9),
("Dynamic Web Project. Tomcat Server.",9),
("Spring Core.",9),
("Spring Core (continue).",9),
("Spring Annotations.",9),
("Spring MVC.",9),
("DBUnits.",9),
("Maven Module Structure.",9),
("Bootstrap.",9),
("GitHub.",9);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("17:30 - 19:00","ПН-СР-ПТ","2016-03-31",9),
("19:00 – 20:30","ПН-СР-ПТ","2016-03-31",9),
("20:30 – 22:00","ПН-СР-ПТ","2016-03-31",9),
("19:00 – 22:00","ВТ-ЧТ","2016-03-30",9),
("10:30 – 13:30","СБ-НД","2016-03-25",9);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(16,32,4500,10000,9);




/* News */
CREATE TABLE IF NOT EXISTS News(
	id_News INT PRIMARY KEY AUTO_INCREMENT,
    title_News VARCHAR(255) NOT NULL,
    description_News VARCHAR(255) NOT NULL,
    src_News VARCHAR(255) NOT NULL,
    date_News DATE NOT NULL
);


CREATE TABLE IF NOT EXISTS NewsDesc(
	id_NewsDesc INT PRIMARY KEY AUTO_INCREMENT,
    title_NewsDesc TEXT(2500),
    description_NewsDesc TEXT(2500),
    src_NewsDesc VARCHAR(255),
    fk_NewsDesc_News INT NOT NULL
);


ALTER TABLE NewsDesc ADD CONSTRAINT NewsDesc_News FOREIGN KEY (fk_NewsDesc_News) REFERENCES News(id_News);


/* News 1 */
INSERT INTO News (title_News,description_News,src_News,date_News) VALUES
("8 МІФІВ ПРО JAVA","Java – сучасна програмна платформа, яка, …","../../src/img/news/about-java.jpg","2017-01-31");


INSERT INTO NewsDesc (title_NewsDesc,description_NewsDesc,src_NewsDesc,fk_NewsDesc_News) VALUES
("1. Java – повільна","Такий міф має давні корені, бо справді колись Java працювала дещо повільніше. Проте тепер Java компілюється та в процесі оптимізується на основі інформації, яка зібрана в ході реалізації програми. Таким чином швидкість роботи байт-кодів на сьогоднішніх віртуальних машинах майже не уступає компіляторам машинних кодів. Отож, міф про повільність платформи Java – спростовано.","../../src/img/news/hourglass-128.png",1),
("2. Програмувати на Java – важко","Java використовує багато відомих елементів синтаксису С++, тож для всіх хто хоча б поверхнево знайомий з програмуванням проблем у освоєнні Java не виникне. Для повноцінного вивчення та розуміння платформи краще все ж таки піти на курси Java. Освоєння платформи Java дається студентам досить легко та відкриває перед ними широкі можливості. Варто зазначити, в Java вмонтована підтримка мультитаскінгу, це дозволяє розробникам не опиратись на ресурси керуючої системи, а використовувати виключно основу конструкції самої Java, що значно спрощує програмування.","../../src/img/news/tools-128.png",1),
("3. Робота Java ідентична на різних машинах та платформах","«Один код для усіх» – цей лозунг творців Java стверджує, що програми на Java працюють на різних платформах- однаково. Однак в реальності, є незначні відхилення в залежності від різних девайсів та систем, тому краще Java-додатки «проганяти» по кількох платформах та не використовувати нестандартні розширення для програмування, якщо не бажаєте зайвих збоїв в функціонуванні програми.","../../src/img/news/stack-128.png",1),
("4. Java – це лише мова програмування","Java – сучасна програмна платформа, яка, по великому рахунку, має на меті замінити усі функції операційної системи. Основна фішка Java – платформо-незалежність, тобто незалежність віртуальної машини від апаратного устаткування та системи. Для Java існує декілька десятків різних програмних мов, одні з яких компілюються, а інші працюють безпосередньо із віртуальною машиною.","../../src/img/news/computer-128.png",1),
("5. Java молодша сестра С++","Насправді Java не є молодшою сестрою С++, на меті розробників було максимальне спрощення вивчення Java, тому тут використано багато елементів із синтаксису відомих мов програмування. Деякі елементи були взяті із Pascal, принцип інтерфейсу класів адаптований із Objective C, а механізм обробки виключних ситуацій запозичений із C-подібних мов. Тому, вважати Java похідним якоїсь однієї мови програмування – некоректно.","../../src/img/news/booklet-128.png",1),
("6. Java використовується тільки для аплетів в Інтернеті","Ідея вмонтованих програм у гіпертекстові документи не нова, доволі багато компаній намагались завоювати цей ринок, проте наразі гідних конкурентів, що були б здатні витіснити Java немає. Звісно ж, окрім використання у якості аплетів, Java має й інші застосування. Як приклад: серверні додатки, що володіють доступом до дата-баз та програми для роботи в мережі — це головна галузь використання технологій Java сьогодні.","../../src/img/news/browser-128.png",1),
("7. Java ідеальна і не потребує покращень","Java була створена в 95-му році, з тих пір стабільно розвивається, оновлюється та додає нові можливості. Проте немає нічого ідеального і розробники це усвідомлюють, тому продовжують вдосконалення та розвиток. Серед недоліків, які б могли бути виправлені програмісти виділяють відсутність шаблонів, також не вистачає перевірки умов виконання програми, програмування «по-контракту» і т.д. Ймовірно, ці недоліки будуть виправлені розробниками найближчим часом.","../../src/img/news/heart-128.png",1),
("8. Проекти на Java коштують дуже багато грошей","Насправді ціна напряму залежить від складності програми, яка розробляється. Відповідно, чим простіший додаток тим менше він коштуватиме. Робота кваліфікованого Java-програміста не безкоштовна й розраховується відповідно до затрат часу на реалізацію проекту. Загалом Java цілком доступна технологія. Спеціалісти, які добре розбираються в Java надзвичайно затребувані. Тож, якщо Ви перебуваєте в пошуку професії, то курси Java – ідеальна можливість для отримання високооплачуваної спеціальності.","../../src/img/news/money-128.png",1);


/* News 2 */
INSERT INTO News (title_News,description_News,src_News,date_News) VALUES
("ЯК ВИРІШИТИ ПРОБЛЕМУ ВІДСУТНОСТІ ДОСВІДУ","Одна з найбільших проблем молодих спеціалістів …","../../src/img/news/experience-problem-768x433.jpg","2017-02-05");


INSERT INTO NewsDesc (title_NewsDesc,description_NewsDesc,src_NewsDesc,fk_NewsDesc_News) VALUES
("","Одна з найбільших проблем молодих спеціалістів – відсутність досвіду. Тестувальники в даному випадку теж не є винятком, роботодавців завжди цікавить досвід роботи претендента на вакантну посаду, адже це інформація, що може розкрити можливості спеціаліста. Пошук досвіду та першого робочого місця є одним з найважчих етапів у будь-якій кар’єрі.Де ж взяти досвід?","",2),
("«Працюємо безкоштовно» – тобто, за досвід.","В мережі є чимало open source проектів, яким потрібні тестувальники, попрацювавши над кількома такими проектами, ви не тільки допоможете розробникам, а ще й отримаєте чималий досвід, який буде для вас безцінним. Робота над такими проектами позитивно впливає на враження про Вас, як про спеціаліста. Адже, незважаючи на відсутність винагороди, Ви зацікавились безкоштовним проектом, а значить, Ви любите те, що робите, що доволі важливо для потенційного роботодавця.","../../src/img/news/check-1.png",2),
("Тестуйте улюблені продукти, веб-сайти чи додатки.","Щоденно Ви користуєтесь безліччю ресурсів, які могли б професійно протестувати для отримання досвіду. До прикладу, можете розпочати із переліку улюблених веб-сайтів, відшукайте на них баги, сформуйте чіткий звіт та відправте на пошту, що вказана на сайті. Формуючи листа вкажіть, що Ви тестувальник та шанувальник ресурсу, бажаєте покращити його роботу, тому вирішили допомогти. Не критикуйте і уникайте різких висловлювань, тоді більшість веб-майстрів та власників веб-ресурсів будуть Вам невимовно вдячні. А можливо хтось із них, запропонує Вам на фрілансі провести тестування й інших проектів компанії. Найкраще проводити тестування usability та функціональності сайтів. Пам’ятайте, що тестування безпеки без дозволу власника сайту краще не проводити.","../../src/img/news/heart-128.png",2),
("Беріть участь в бета-тестуванні.","Доволі часто великі компанії та корпорації викладають свої продукти для бета тестування. За такою схемою працює чимало компаній, зокрема Apple таким чином перевіряє працездатність нових версій IOS. Участь в такому тестуванні це не тільки додатковий досвід, а також можливість вписати імениту компанію у власне резюме.","../../src/img/news/speedometer.png",2),
("","Підсумовуючи зазначимо, що досвід в період пошуку роботи грає важливу роль. На перших етапах заглиблення в ІТ сферу, молодим спеціалістам слід орієнтуватись не на рівень заробітку, а на можливість отримати досвід. А от досвідчений ІТ спеціаліст, вже може собі дозволити обирати компанії та проекти, які варті його уваги. Станьте професіоналом, наберіться досвіду і тоді не матимете проблем із пошуком добре фінансованих проектів та роботи.","",2);


/* News 3 */
INSERT INTO News (title_News,description_News,src_News,date_News) VALUES
("JAVASCRIPT З НУЛЯ: ЯК СТАТИ ПРОГРАМІСТОМ ЯКЩО ТИ ЧАЙНИК","JavaScript відкриває безліч…","../../src/img/news/javascript-beginer.jpg","2017-02-08");


INSERT INTO NewsDesc (title_NewsDesc,description_NewsDesc,src_NewsDesc,fk_NewsDesc_News) VALUES
("","JavaScript відкриває безліч можливостей для розробників та використовується в більшості інтернет проектів, браузерних додатках, мобільних програмах та іграх, дозволяє створювати унікальні інтерактивні веб-сторінки з надзвичайно широкими можливостями. На сьогоднішній день розробка сучасних веб-сайтів не обходиться без використання JavaScript, а затребуваність ринку у спеціалістах, які володіють програмуванням JavaScript стабільно зростає. Варто зазначити, що програмування JavaScript вивчити не так важко, як видається на перший погляд, та з допомогою досвідчених викладачів-практиків зробити це можна у відносно короткі терміни.","../../src/img/news/ZHuk-1024x683-570x321.jpg",3),
("","Найкращим закладом, де можна знайти курси JavaScript у Львові – є Logos IT Academy, однією із найбільших переваг академії є професійність викладачів – експертів у своїй справі, які практично працюють із JavaScript та чудово знають на яких нюансах роботи варто робити акцент та які знання 100% стануть невід’ємними у роботі.","",3),
("З чого почати вивчення JavaScript","Перед вивченням JavaScript рекомендується вивчити основи HTML, щоб зрозуміти, як власне працюють скрипти, в який спосіб вони інтегруються у веб-сайти, та що робить інтернет-браузер, коли зустрічає JavaScript в коді.","",3),
("","Самостійно шукати літературу необхідну для вивчення JavaScript доволі складно, адже інформації надзвичайно багато, частина є застарілою, інша викладена складною технічною мовою. Щоб себе не заплутувати, краще читати рекомендовану викладачами літературу.","",3),
("","Яким чином здобути максимум знань протягом проходження курсу по JavaScript? Ось декілька порад, які допоможуть досягнути більший успіх в навчанні:","",3),
("","Під час підготовки до занять формуйте список питань, які у Вас виникають, детально розбирайте їх з викладачами до повного розуміння.","../../src/img/news/document.png",3),
("","Виконуйте усі домашні завдання – більшість з них згодяться Вам в подальшій роботі.","../../src/img/news/pencil.png",3),
("","Максимум практики, чим більше Ви працюватимете, тим більшу кількість інформації Ви отримаєте.","../../src/img/news/dev.png",3),
("","Читайте рекомендовану літературу, аналізуйте, робіть висновки, ведіть дискусії на цікаві теми з групою та викладачами.","../../src/img/news/bookshelf.png",3),
("","Пам’ятайте, що до курсу слід ставитись серйозно та відповідально, адже він може змінити Ваше життя та перетворити у високооплачуваного професіонала.","../../src/img/news/money-128.png",3),
("","Перед початком знайомства з JavaSсript рекомендуємо освоїти HTML/CSS.","",3);






select * from course as c join programs as p on c.id_Course=p.fk_Programs_Course where c.id_Course=2;
