create database if not exists Diploma;

use Diploma;


/* Course */
CREATE TABLE IF NOT EXISTS Course(
	id_Course INT PRIMARY KEY AUTO_INCREMENT,
    title_Course VARCHAR(255) NOT NULL,
    description_Course text(2500) NOT NULL,
    src_Course VARCHAR(255) NOT NULL
);


CREATE TABLE IF NOT EXISTS Programs(
	id_Programs INT PRIMARY KEY AUTO_INCREMENT,
    description_Programs text(2500) NOT NULL,
    fk_Programs_Course INT NOT NULL
);


CREATE TABLE IF NOT EXISTS Times(
	id_Times INT PRIMARY KEY AUTO_INCREMENT,
    time_Times VARCHAR(255) NOT NULL,
    days_Times VARCHAR(255) NOT NULL,
    start_Times DATE NOT NULL,
    fk_Times_Course INT NOT NULL
);


CREATE TABLE IF NOT EXISTS Price(
	id_Price INT PRIMARY KEY AUTO_INCREMENT,
    countLessons_Price INT NOT NULL,
    countAcademOclock_Price INT NOT NULL,
    priceGroupLessons_Price INT NOT NULL,
    priceIndividLessons_Price INT NOT NULL,
    fk_Price_Course INT NOT NULL
);


ALTER TABLE Programs ADD CONSTRAINT Programs_Course FOREIGN KEY (fk_Programs_Course) REFERENCES Course(id_Course);
ALTER TABLE Times ADD CONSTRAINT Times_Course FOREIGN KEY (fk_Times_Course) REFERENCES Course(id_Course);
ALTER TABLE Price ADD CONSTRAINT Price_Course FOREIGN KEY (fk_Price_Course) REFERENCES Course(id_Course);


/* JavaScript*/
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("JavaScript","Курси JavaSсript у Львові охоплюють основи створення інтерактивних веб-сторінок за допомогою мови JavaScript і об’єктно-орієнтованого програмування. Основний акцент в курсі зроблений на практичних завданнях, що дозволяє краще засвоїти матеріал і закріпити отримані знання. Використання фреймворку JQuery і JQuery UI дозволить легко і елегантно організувати логіку роботи веб-додатків будь-якої складності на стороні клієнта. Ви також навчитеся основним засобам доступу до вузлів DOM документа для ефективної розробки сценаріїв сторінки.","/src/img/course_JS.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Що таке JavaScript? Як викликати JavaScript? З чим взаємодіє JavaScript?",1),
("Типи даних, вирішення логічних задач на JavaScript.",1),
("Структура DOM документа, робота з DOM за допомогою JavaScript.",1),
("Функції, область видимості змінних, інші плюшки.",1),
("Робота з формами, стилями, обробники подій.",1),
("Приклад обробки: натиснення на кнопку, скролінг елемента, наведення курсора мишки, обробки форм на стороні клієнта...",1),
("Створення слайдера на JavaScript.",1),
("Загальні поняття ООП: клас, об'єкт, особливості ООП в JavaScript.",1),
("Масиви та асоціативні масиви, робота з масивами на практиці.",1),
("Об’єкт Math та його користь для сценарію, приклад годинника на JavaScript.",1),
("Навіщо потрібні фреймворки? Що таке JQuery? Де скачати і як підключити?",1),
("Робота з DOM за допомогою JQuery, селектори та ієрархія JQuery, фільтри, приклади складних фільтрів в JQuery.",1),
("Анімація в JQuery, прості анімаційні ефекти, ланцюжки з анімацій.",1),
("Створення слайдера на JQuery.",1),
("JQuery UI: де скачати та як встановити? Ефекти, підключення календаря.",1),
("Плагіни: draggable, droppable.",1),
("Що таке parallax scrolling? Застосування parallax scrolling на практиці.",1);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("17:30 – 19:00","ПН-СР-ПТ","2017-02-20",1),
("10:30 – 13:30","СБ-НД","2017-02-18",1);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,4500,10000,1);



/* JavaScript Advanced */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("JavaScript Advanced","Курси JavaScript Advanced охоплюють всі необхідні знання мови JavaScript які на сьогоднішній день є затребуваними в ІТ компаніях. Для вступу на курс необхідно володіти знаннями HTML/CSS на високому рівні, а також JavaScript (бажано пройти курс JavaScript). На курсі студенти випробують усі сторони ООП програмування на JavaScript, познайомляться з регулярними виразами та технологією AJAX. Також розглянуть популярні JavaScript фреймворки: Angular.js, Node.js, за допомогою яких студенти зможуть створювати неймовірні веб додатки які нагадують десктоп, а також створювати back-end частину. На курсі перевагу надають саме практичним заняттям, створенню міні додатків, а також окремих частин веб сторінок. На курсі ви навчитеся основним засобам JavaScript для ефективної та сучасної веб розробки.","/src/img/course_JS_Advanced.PNG");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Поняття ООП в JavaScript.",2),
("Варіанти наслідування та прототипування.",2),
("Практика в ООП, this та шаблони виклику функцій.",2),
("Регулярні вирази, здійснення пошуку за допомогою регулярних виразів.",2),
("Використання регулярних виразів для валідації, правила пошуку тексту.",2),
("JSON. Серіалізація, передача даних за допомогою об'єктного запису JavaScript.",2),
("AJAX. HTTP запити, що це? Як працюють. Взаємодія 'КЛІЄНТ - Сервер'.",2),
("Використання методів AJAX для відправки та отримання даних.",2),
("Для чого потрібні фреймворки?",2),
("Підключення до сторінки Angular.js. Двостороннє зв'язування та інші особливості Angular.js.",2),
("Неймовірні веб-додатки що нагадують Desktop.",2),
("Node.js. Що таке серверний JavaScript?",2),
("Які переваги? Асинхронність роботи 'КЛІЄНТ - Сервер'.",2),
("Модулі Node.js. Пишем сервер JavaScript.",2);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("19:00 - 20:30","ВТ-ЧТ","2017-01-17",2),
("14:00 – 17:00","СБ-НД","2017-02-25",2);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(24,48,5500,10000,2);



/* Основи програмування */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("Основи програмування","Основи програмування – це безкоштовний курс, програма якого спеціально розроблена для людей без попереднього досвіду у сфері програмування.

Головний акцент ставиться саме на практичні заняття, тому кожен слухач курсу окрім необхідної теорії розпочинає безпосередньо програмувати – самостійно створює цикли, масиви та алгоритми для вирішення конкретних завдань.

Окрім того курс Основи програмування дає змогу усвідомити різницю між різними мовами програмування, завдяки чому Ви зможете обрати той напрямок із світу ІТ технологій, який підходить саме Вам.","/src/img/course_Основи_програмування.png");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Комп’ютер та його основні компоненти: пристрої зберігання даних, пристрої введення, пристрої виведення, периферійні пристрої комп’ютера.",3),
("Системи числення: двійкова, вісімкова, шістнадцяткова. Робота з ними.",3),
("Типологія мов програмування: функціональні, об’єктно-орієнтовані, аспектно-орієнтовані, скриптові, процедурні.",3),
("Алгоритми. Поняття алгоритму та його значення, типи алгоритмів, основні компоненти алгоритму, побудова алгоритмів.",3),
("Арифметичні операції. Типи даних. Змінні.",3),
("Строго типізовані і не строго типізовані мови програмування, відмінності.",3),
("Створення, оголошення, ініціалізація змінних.",3),
("Синтаксичні конструкції, побудова програми з їх допомогою.",3),
("Умовні конструкції (if, else if, else, switch).",3),
("Цикли (while, do while, for).",3),
("Масиви: одномірні і багатомірні масиви, робота з ними. Цикл foreach.",3),
("Основи GUI(Swing): основні компоненти, розміщення, взаємодія.",3),
("HTML/CSS: поняття тегів, та їх атрибути, розміщення елементів на сторінці. Основи CSS, селектори.",3),
("JavaScript: змінні та функції. Обробка подій.",3);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("09:00 – 10:30","ПН-ВТ-СР-ЧТ-ПТ","2017-01-30",3),
("10:30 – 12:00","ПН-ВТ-СР-ЧТ-ПТ","2017-01-30",3),
("12:00 – 13:30","ПН-ВТ-СР-ЧТ-ПТ","2017-01-30",3);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(12,24,0,1,3);



/* MySQL */
INSERT INTO Course (title_Course,description_Course,src_Course) VALUES
("MySQL","Курси MySQL призначені для програмістів бажаючих познайомитися з мистецтвом проектування баз даних в теорії і на практиці. Після цього курсу Ви зможете не просто самостійно проектувати і використовувати бази даних, але й робити це розумно й ефективно. У світі сучасного промислового програмування програміст, який не володіє SQL – це нонсенс (за винятком рідкісних випадків достатньо вузької спеціалізації). В курсі розглянуті питання теорії баз даних, мови SQL як засобу взаємодії з БД, прийомів правильного проектування БД і складання запитів. Практична частина курсу заснована на сервері MySQL, що робить курс особливо цінним для початківців веб-програмістів.","/src/img/course_MySQL.PNG");


INSERT INTO Programs (description_Programs,fk_Programs_Course) VALUES
("Вступ, реляційні бази даних: що таке база даних? Що таке реляційна база даних?",4),
("Приклади коду на мові SQL (створювати, видаляти, вибирати, оновлювати, вставляти).",4),
("Короткий огляд основних діалектів SQL (MSSQL, Oracle, MySQL, SQLite).",4),
("Знайомство з MySQL. Роль MySQL в розробці Web-Проектів.",4),
("Клієнтські програми для роботи з MySQL (PhpMyAdmin, HeidiSQL, MySQL).",4),
("Основні принципи проектування таблиць: одна таблиця - одна сутність, ключ кандидат, первинний ключ, зовнішній ключ.",4),
("Типи зв'язків: зв'язок 'Один-до-багатьох', зв'язок 'Один-до-одного', зв'язок 'Багато-до-багатьох'.",4),
("Робота з базами даних, робота з таблицями.",4),
("Типи даних SQL, сновні типи даних: вибір типів даних полів таблиць, особливе значення NULL.",4),
("Управління даними на SQL (DML): вставка, видалення, оновлення, вибірка даних.",4),
("Оператор Select і робота з ним.",4),
("Складна вибірка і модифікація даних.",4),
("Збережені процедури і транзакції.",4),
("Специфіка роботи з MySQL.",4),
("Управління доступом до бази даних.",4),
("Команди огляду БД і таблиць.",4),
("Види движків таблиць: MyISAM, InnoDB, Memory.",4);


INSERT INTO Times (time_Times,days_Times,start_Times,fk_Times_Course) VALUES
("19:00 - 20:30","СБ-НД","2017-02-11",4),
("19:00 – 22:00","ВТ-ЧТ","2017-02-07",4);


INSERT INTO Price (countLessons_Price,countAcademOclock_Price,priceGroupLessons_Price,priceIndividLessons_Price,fk_Price_Course) VALUES
(12,24,3000,4500,4);




/* News */
CREATE TABLE IF NOT EXISTS News(
	id_News INT PRIMARY KEY AUTO_INCREMENT,
    title_News VARCHAR(255) NOT NULL,
    description_News VARCHAR(255) NOT NULL,
    src_News VARCHAR(255) NOT NULL,
    date_News DATE NOT NULL
);


CREATE TABLE IF NOT EXISTS NewsDesc(
	id_NewsDesc INT PRIMARY KEY AUTO_INCREMENT,
    title_NewsDesc TEXT(2500),
    description_NewsDesc TEXT(2500),
    src_NewsDesc VARCHAR(255),
    fk_NewsDesc_News INT NOT NULL
);


ALTER TABLE NewsDesc ADD CONSTRAINT NewsDesc_News FOREIGN KEY (fk_NewsDesc_News) REFERENCES News(id_News);


/* News 1 */
INSERT INTO News (title_News,description_News,src_News,date_News) VALUES
("8 МІФІВ ПРО JAVA","Java – сучасна програмна платформа, яка, …","../../src/img/news/about-java.jpg","2017-01-31");


INSERT INTO NewsDesc (title_NewsDesc,description_NewsDesc,src_NewsDesc,fk_NewsDesc_News) VALUES
("1. Java – повільна","Такий міф має давні корені, бо справді колись Java працювала дещо повільніше. Проте тепер Java компілюється та в процесі оптимізується на основі інформації, яка зібрана в ході реалізації програми. Таким чином швидкість роботи байт-кодів на сьогоднішніх віртуальних машинах майже не уступає компіляторам машинних кодів. Отож, міф про повільність платформи Java – спростовано.","../../src/img/news/hourglass-128.png",1),
("2. Програмувати на Java – важко","Java використовує багато відомих елементів синтаксису С++, тож для всіх хто хоча б поверхнево знайомий з програмуванням проблем у освоєнні Java не виникне. Для повноцінного вивчення та розуміння платформи краще все ж таки піти на курси Java. Освоєння платформи Java дається студентам досить легко та відкриває перед ними широкі можливості. Варто зазначити, в Java вмонтована підтримка мультитаскінгу, це дозволяє розробникам не опиратись на ресурси керуючої системи, а використовувати виключно основу конструкції самої Java, що значно спрощує програмування.","../../src/img/news/tools-128.png",1),
("3. Робота Java ідентична на різних машинах та платформах","«Один код для усіх» – цей лозунг творців Java стверджує, що програми на Java працюють на різних платформах- однаково. Однак в реальності, є незначні відхилення в залежності від різних девайсів та систем, тому краще Java-додатки «проганяти» по кількох платформах та не використовувати нестандартні розширення для програмування, якщо не бажаєте зайвих збоїв в функціонуванні програми.","../../src/img/news/stack-128.png",1),
("4. Java – це лише мова програмування","Java – сучасна програмна платформа, яка, по великому рахунку, має на меті замінити усі функції операційної системи. Основна фішка Java – платформо-незалежність, тобто незалежність віртуальної машини від апаратного устаткування та системи. Для Java існує декілька десятків різних програмних мов, одні з яких компілюються, а інші працюють безпосередньо із віртуальною машиною.","../../src/img/news/computer-128.png",1),
("5. Java молодша сестра С++","Насправді Java не є молодшою сестрою С++, на меті розробників було максимальне спрощення вивчення Java, тому тут використано багато елементів із синтаксису відомих мов програмування. Деякі елементи були взяті із Pascal, принцип інтерфейсу класів адаптований із Objective C, а механізм обробки виключних ситуацій запозичений із C-подібних мов. Тому, вважати Java похідним якоїсь однієї мови програмування – некоректно.","../../src/img/news/booklet-128.png",1),
("6. Java використовується тільки для аплетів в Інтернеті","Ідея вмонтованих програм у гіпертекстові документи не нова, доволі багато компаній намагались завоювати цей ринок, проте наразі гідних конкурентів, що були б здатні витіснити Java немає. Звісно ж, окрім використання у якості аплетів, Java має й інші застосування. Як приклад: серверні додатки, що володіють доступом до дата-баз та програми для роботи в мережі — це головна галузь використання технологій Java сьогодні.","../../src/img/news/browser-128.png",1),
("7. Java ідеальна і не потребує покращень","Java була створена в 95-му році, з тих пір стабільно розвивається, оновлюється та додає нові можливості. Проте немає нічого ідеального і розробники це усвідомлюють, тому продовжують вдосконалення та розвиток. Серед недоліків, які б могли бути виправлені програмісти виділяють відсутність шаблонів, також не вистачає перевірки умов виконання програми, програмування «по-контракту» і т.д. Ймовірно, ці недоліки будуть виправлені розробниками найближчим часом.","../../src/img/news/heart-128.png",1),
("8. Проекти на Java коштують дуже багато грошей","Насправді ціна напряму залежить від складності програми, яка розробляється. Відповідно, чим простіший додаток тим менше він коштуватиме. Робота кваліфікованого Java-програміста не безкоштовна й розраховується відповідно до затрат часу на реалізацію проекту. Загалом Java цілком доступна технологія. Спеціалісти, які добре розбираються в Java надзвичайно затребувані. Тож, якщо Ви перебуваєте в пошуку професії, то курси Java – ідеальна можливість для отримання високооплачуваної спеціальності.","../../src/img/news/money-128.png",1);


/* News 2 */
INSERT INTO News (title_News,description_News,src_News,date_News) VALUES
("ЯК ВИРІШИТИ ПРОБЛЕМУ ВІДСУТНОСТІ ДОСВІДУ","Одна з найбільших проблем молодих спеціалістів …","../../src/img/news/experience-problem-768x433.jpg","2017-02-05");


INSERT INTO NewsDesc (title_NewsDesc,description_NewsDesc,src_NewsDesc,fk_NewsDesc_News) VALUES
("","Одна з найбільших проблем молодих спеціалістів – відсутність досвіду. Тестувальники в даному випадку теж не є винятком, роботодавців завжди цікавить досвід роботи претендента на вакантну посаду, адже це інформація, що може розкрити можливості спеціаліста. Пошук досвіду та першого робочого місця є одним з найважчих етапів у будь-якій кар’єрі.Де ж взяти досвід?","",2),
("«Працюємо безкоштовно» – тобто, за досвід.","В мережі є чимало open source проектів, яким потрібні тестувальники, попрацювавши над кількома такими проектами, ви не тільки допоможете розробникам, а ще й отримаєте чималий досвід, який буде для вас безцінним. Робота над такими проектами позитивно впливає на враження про Вас, як про спеціаліста. Адже, незважаючи на відсутність винагороди, Ви зацікавились безкоштовним проектом, а значить, Ви любите те, що робите, що доволі важливо для потенційного роботодавця.","../../src/img/news/check-1.png",2),
("Тестуйте улюблені продукти, веб-сайти чи додатки.","Щоденно Ви користуєтесь безліччю ресурсів, які могли б професійно протестувати для отримання досвіду. До прикладу, можете розпочати із переліку улюблених веб-сайтів, відшукайте на них баги, сформуйте чіткий звіт та відправте на пошту, що вказана на сайті. Формуючи листа вкажіть, що Ви тестувальник та шанувальник ресурсу, бажаєте покращити його роботу, тому вирішили допомогти. Не критикуйте і уникайте різких висловлювань, тоді більшість веб-майстрів та власників веб-ресурсів будуть Вам невимовно вдячні. А можливо хтось із них, запропонує Вам на фрілансі провести тестування й інших проектів компанії. Найкраще проводити тестування usability та функціональності сайтів. Пам’ятайте, що тестування безпеки без дозволу власника сайту краще не проводити.","../../src/img/news/heart-128.png",2),
("Беріть участь в бета-тестуванні.","Доволі часто великі компанії та корпорації викладають свої продукти для бета тестування. За такою схемою працює чимало компаній, зокрема Apple таким чином перевіряє працездатність нових версій IOS. Участь в такому тестуванні це не тільки додатковий досвід, а також можливість вписати імениту компанію у власне резюме.","../../src/img/news/speedometer.png",2),
("","Підсумовуючи зазначимо, що досвід в період пошуку роботи грає важливу роль. На перших етапах заглиблення в ІТ сферу, молодим спеціалістам слід орієнтуватись не на рівень заробітку, а на можливість отримати досвід. А от досвідчений ІТ спеціаліст, вже може собі дозволити обирати компанії та проекти, які варті його уваги. Станьте професіоналом, наберіться досвіду і тоді не матимете проблем із пошуком добре фінансованих проектів та роботи.","",2);


/* News 3 */
INSERT INTO News (title_News,description_News,src_News,date_News) VALUES
("JAVASCRIPT З НУЛЯ: ЯК СТАТИ ПРОГРАМІСТОМ ЯКЩО ТИ ЧАЙНИК","JavaScript відкриває безліч…","../../src/img/news/javascript-beginer.jpg","2017-02-08");


INSERT INTO NewsDesc (title_NewsDesc,description_NewsDesc,src_NewsDesc,fk_NewsDesc_News) VALUES
("","JavaScript відкриває безліч можливостей для розробників та використовується в більшості інтернет проектів, браузерних додатках, мобільних програмах та іграх, дозволяє створювати унікальні інтерактивні веб-сторінки з надзвичайно широкими можливостями. На сьогоднішній день розробка сучасних веб-сайтів не обходиться без використання JavaScript, а затребуваність ринку у спеціалістах, які володіють програмуванням JavaScript стабільно зростає. Варто зазначити, що програмування JavaScript вивчити не так важко, як видається на перший погляд, та з допомогою досвідчених викладачів-практиків зробити це можна у відносно короткі терміни.","../../src/img/news/ZHuk-1024x683-570x321.jpg",3),
("","Найкращим закладом, де можна знайти курси JavaScript у Львові – є Logos IT Academy, однією із найбільших переваг академії є професійність викладачів – експертів у своїй справі, які практично працюють із JavaScript та чудово знають на яких нюансах роботи варто робити акцент та які знання 100% стануть невід’ємними у роботі.","",3),
("З чого почати вивчення JavaScript","Перед вивченням JavaScript рекомендується вивчити основи HTML, щоб зрозуміти, як власне працюють скрипти, в який спосіб вони інтегруються у веб-сайти, та що робить інтернет-браузер, коли зустрічає JavaScript в коді.","",3),
("","Самостійно шукати літературу необхідну для вивчення JavaScript доволі складно, адже інформації надзвичайно багато, частина є застарілою, інша викладена складною технічною мовою. Щоб себе не заплутувати, краще читати рекомендовану викладачами літературу.","",3),
("","Яким чином здобути максимум знань протягом проходження курсу по JavaScript? Ось декілька порад, які допоможуть досягнути більший успіх в навчанні:","",3),
("","Під час підготовки до занять формуйте список питань, які у Вас виникають, детально розбирайте їх з викладачами до повного розуміння.","../../src/img/news/document.png",3),
("","Виконуйте усі домашні завдання – більшість з них згодяться Вам в подальшій роботі.","../../src/img/news/pencil.png",3),
("","Максимум практики, чим більше Ви працюватимете, тим більшу кількість інформації Ви отримаєте.","../../src/img/news/dev.png",3),
("","Читайте рекомендовану літературу, аналізуйте, робіть висновки, ведіть дискусії на цікаві теми з групою та викладачами.","../../src/img/news/bookshelf.png",3),
("","Пам’ятайте, що до курсу слід ставитись серйозно та відповідально, адже він може змінити Ваше життя та перетворити у високооплачуваного професіонала.","../../src/img/news/money-128.png",3),
("","Перед початком знайомства з JavaSсript рекомендуємо освоїти HTML/CSS.","",3);






select * from course as c join programs as p on c.id_Course=p.fk_Programs_Course where c.id_Course=2;
